OpenFOAM/create_turbulence/system/blockMeshDict
/****************************************************************/
            FoamFile
            {
            version     2.0;
            format      ascii;
            class       dictionary;
            object      blockMeshDict;
            }
/****************************************************************/





vertices
(
( -6.0 -5.0 0.0 )  //0
( -6.0 -5.0 5.0 )  //1
( -6.0 5.0 0.0 )  //2
( -6.0 5.0 5.0 )  //3
( 6.0 -5.0 0.0 )  //4
( 6.0 -5.0 5.0 )  //5
( 6.0 5.0 0.0 )  //6
( 6.0 5.0 5.0 )  //7
);




blocks
(
hex (0 4 6 2 1 5 7 3) (30 25 12) simpleGrading (1 1 1) 

);




edges
(
);




boundary
(
x0
 {  type patch;
  faces 
  (
(0 2 3 1)
   );
 }





x1
 {  type patch;
  faces 
  (
(6 4 5 7)
   );
 }





y0
 {  type patch;
  faces 
  (
(0 4 5 1)
   );
 }





y1
 {  type patch;
  faces 
  (
(2 6 7 3)
   );
 }





z0
 {  type patch;
  faces 
  (
(0 2 6 4)
   );
 }





z1
 {  type patch;
  faces 
  (
(5 7 3 1)
   );
 }





);
mergePatchPairs ();